<a href="https://colab.research.google.com/github/adimika04-collab/Basis-Data/blob/main/Hands_On_Basis_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Install dan Jalankan MySQL

In [25]:
!apt-get update
!apt-get install -y mysql-server
!service mysql start

Hit:1 https://cli.github.com/packages stable InRelease
Hit:2 https://cloud.r-project.org/bin/linux/ubuntu jammy-cran40/ InRelease
Hit:3 http://archive.ubuntu.com/ubuntu jammy InRelease
Hit:4 http://security.ubuntu.com/ubuntu jammy-security InRelease
Hit:5 https://r2u.stat.illinois.edu/ubuntu jammy InRelease
Hit:6 http://archive.ubuntu.com/ubuntu jammy-updates InRelease
Hit:7 http://archive.ubuntu.com/ubuntu jammy-backports InRelease
Hit:8 https://ppa.launchpadcontent.net/deadsnakes/ppa/ubuntu jammy InRelease
Hit:9 https://ppa.launchpadcontent.net/ubuntugis/ppa/ubuntu jammy InRelease
Reading package lists... Done
W: Skipping acquire of configured file 'main/source/Sources' as repository 'https://r2u.stat.illinois.edu/ubuntu jammy InRelease' does not seem to provide it (sources.list entry misspelt?)
Reading package lists... Done
Building dependency tree... Done
Reading state information... Done
mysql-server is already the newest version (8.0.45-0ubuntu0.22.04.1).
0 upgraded, 0 newly installed, 0 to remove and 103 not upgraded.
 * Starting MySQL database server mysqld
   ...done.

2. Cek MySQL Sudah Aktif

In [26]:
!mysql -u root -e "SELECT VERSION();"

+-------------------------+
| VERSION()               |
+-------------------------+
| 8.0.45-0ubuntu0.22.04.1 |
+-------------------------+

3. Create Database

In [27]:
!mysql -u root -e "CREATE DATABASE produk_db;"

ERROR 1007 (HY000) at line 1: Can't create database 'produk_db'; database exists

4. Show Database

In [28]:
!mysql -u root -e "SHOW DATABASES;"

+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| produk_db          |
| sys                |
+--------------------+

5. Create Database

In [29]:
!mysql -u root -D produk_db -e "CREATE TABLE produk (id_produk INT PRIMARY KEY, nama_produk VARCHAR(50), harga INT);"

#Menampilkan daftar tabel
!mysql -u root -D produk_db -e "SHOW TABLES;"

#Menampilkan struktur tabel produk
!mysql -u root -D produk_db -e "DESCRIBE produk;"

ERROR 1050 (42S01) at line 1: Table 'produk' already exists
+---------------------+
| Tables_in_produk_db |
+---------------------+
| produk              |
+---------------------+
+-------------+-------------+------+-----+---------+-------+
| Field       | Type        | Null | Key | Default | Extra |
+-------------+-------------+------+-----+---------+-------+
| id_produk   | int         | NO   | PRI | NULL    |       |
| nama_produk | varchar(50) | YES  |     | NULL    |       |
| harga       | int         | YES  |     | NULL    |       |
+-------------+-------------+------+-----+---------+-------+

6. Insert Into

In [30]:
!mysql -u root -D produk_db -e "INSERT INTO produk (id_produk, nama_produk, harga) VALUES (1, 'Laptop Asus', 8500000), (2, 'Mouse Logitech', 150000), (3, 'Keyboard Mechanical', 450000);"

7. Select

In [35]:
!mysql -u root -D produk_db -e "SELECT * FROM produk;"

+-----------+---------------------+---------+
| id_produk | nama_produk         | harga   |
+-----------+---------------------+---------+
|         1 | Laptop Asus         | 8500000 |
|         2 | Mouse Logitech      |  150000 |
|         3 | Keyboard Mechanical |  450000 |
+-----------+---------------------+---------+

8. Update

In [36]:
!mysql -u root -D produk_db -e "UPDATE produk SET harga = 450000 WHERE nama_produk = 'Laptop Asus';"

#Lihat hasilnya (SELECT)
!mysql -u root -D produk_db -e "SELECT * FROM produk;"

#Lihat data yg di update saja (SELECT)
!mysql -u root -D produk_db -e "SELECT * FROM produk WHERE nama_produk = 'Laptop Asus';"

+-----------+---------------------+--------+
| id_produk | nama_produk         | harga  |
+-----------+---------------------+--------+
|         1 | Laptop Asus         | 450000 |
|         2 | Mouse Logitech      | 150000 |
|         3 | Keyboard Mechanical | 450000 |
+-----------+---------------------+--------+
+-----------+-------------+--------+
| id_produk | nama_produk | harga  |
+-----------+-------------+--------+
|         1 | Laptop Asus | 450000 |
+-----------+-------------+--------+

9. Delete

In [37]:
#Menghapus 1 data pada tabel awal misalnya id = 1
!mysql -u root -D produk_db -e "DELETE FROM produk WHERE nama_produk= ' Laptop Asus';"

#Memastikan hasilnya
!mysql -u root -D produk_db -e "SELECT * FROM produk;"

+-----------+---------------------+--------+
| id_produk | nama_produk         | harga  |
+-----------+---------------------+--------+
|         1 | Laptop Asus         | 450000 |
|         2 | Mouse Logitech      | 150000 |
|         3 | Keyboard Mechanical | 450000 |
+-----------+---------------------+--------+